app/controllers/stick_controller.rb

SELECT "mentioned_users".* FROM "mentioned_users" WHERE "mentioned_users"."user_id" IS NULL
SELECT "sticks".* FROM "sticks" WHERE "sticks"."user_id" = 1
---
  def index
    @logged_user = logged_user
    if @logged_user.nil?
      @my_sticks = []
      return
    end
    @my_sticks = MentionedUser.where( :user_id => logged_user).collect { |uis| uis.stick }

INSERT INTO "sticks" ("updated_at", "user_id", "created_at", "color", "content") VALUES ('2014-01-30 14:48:20.506331', 2, '2014-01-30 14:48:20.506331', 0, 'POSSO MANDA COISA PACASPOSSO MANDA COISA PACASPOSSO MANDA COISA PACASPOSSO MANDA COISA PACASPOSSO MANDA COISA PACASPOSSO MANDA COISA PACAS POSSO MANDA COISA PACAS POSSO MANDA COISA PACAS POSSO MANDA COISA PACAS')
---
  def new
    content = params[:sentence]

    stick = Stick.create :content => content, :user => logged_user

SELECT "mentioned_users".* FROM "mentioned_users" WHERE "mentioned_users"."stick_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "mentioned_users" WHERE "mentioned_users"."id" = 1
DELETE FROM "sticks" WHERE "id"."id" = '46'
SELECT "sticks".* FROM "sticks" WHERE "sticks"."id" = 45 LIMIT 1
SELECT COUNT(*) FROM "mentioned_users" WHERE "mentioned_users"."stick_id" = 1
---
  def delete
    stick_id = params[:id]
    mentions = MentionedUser.where(:stick_id => stick_id)

    mentions.each do |mention|
      if mention.user == logged_user
        mention.delete
      end
    end

    Stick.delete(:id => stick_id) if mentions.empty?