app/controllers/user_controller.rb

  def login
    login = params[:login][:login]
    password = params[:login][:password]
    remember = params[:remember_me]

    user = UserController.find_user(login, password)

    if user.nil?
      flash[:error] = "The informed user was not found or does not match the password!"
      redirect_to_index
      return
    end

    if remember
      cookies[:user_name] = user.name
      cookies[:user_pass] = user.password
    end
    user.rememberme = remember
    user.save
---
SELECT "users".* FROM "users" WHERE ((lower(name) = lower('SAnjos') or lower(email) = lower('SAnjos')) and password = '1234') LIMIT 1
UPDATE "users" SET "updated_at" = '2014-02-04 20:43:45.173519', "rememberme" = NULL WHERE "users"."id" = 1

  def create
    name = params[:login][:name]
    password = params[:login][:password]
    email = params[:login][:email]

    user = User.new :name => name, :password => password, :email => email
    if (user.save)
      flash[:notice] = "Your account was created successfully!"
    else
      user.errors.values.each { |e|
---
INSERT INTO "users" ("created_at", "password", "rememberme", "updated_at", "admin", "name", "email") VALUES ('2014-02-15 13:05:08.352788', '1234', 'f', '2014-02-15 13:05:08.352788', NULL, 'teste', 'teste@teste.com')
SELECT "users".* FROM "users" WHERE ((lower(name) = lower('') or lower(email) = lower('')) and password = '') LIMIT 1